// =====================
// 📁 config.js
// =====================

module.exports = {
  "ايدي سيرفرك": { // M7MD LION
    name: "اسم سيرفرك",
    partnerPrefix: "اسم سيرفرك",
    partnerChannel: "ايدي روم البارتنر",
    defaultMessage: `رسالة سيرفر`, // الرسالة التلقائية التي ترسل في التذكرة بعد ارسال رسالة البارتنر
    lineMessageChannel: "ايدي الروم ارسال امبيد فتح التذكرة",
    ownerPingRole: "ايدي رتبت الاونر",
    ticketCategoryId: "ايدي كاتيجوري فتح التذاكر",
    ticketChannelId: "ايدي روم ارسال امبيد فتح التذكرة", // ← ← ← ← ← ← أضف هذا السطر يا نجم
    welcomeMessage: "رسالة الترحيب عند فتح التذكرة",
    levels: {
basic: {
  title: "شروط البارتنر",
  minMembers: 0, // عدد الاعضاء
  minOnline: 0, // عدد الاونلاين
  requirements: [
    "عدد الاعضاء : اضافة رقم حسب عدد الاعضاء اللازم",
    "عدد الاونلاين : اضافة رقم حسب عدد الاونلاين اللازم",
    "خالي من السب تمامًا",
    "اعضاء و اونر محتريم"
  ]
},

    }
  },

    "1336721165749846107": { // MR MARU
    name: "MR MARU",
    partnerPrefix: "MR MARU",
    partnerChannel: "1394666851828633831",
    defaultMessage: `**مرحبا بكم في سيرفرنا سيرفر 𝗠𝗥 𝗠𝗔𝗥𝗨**

- سيرفر للدردشة و الالعاب و تكوين الاصدقاء

- يوجد تقديم بنات و اولاد للادارة

- لا يوجد سبام او شتايم لا من اعضاء ولا من ادارة

- ادارة محترمين شغالين 24 ساعة 

- بارتنر و دعم فني مفتوحين دائما 

**شكرا لكم جيش 𝗠𝗥 𝗠𝗔𝗥𝗨 مع تحياتي لكم من مصر**

**https://discord.gg/GfDy4RKWPZ **

@here @everyone`,
    lineMessageChannel: "1396669269281996830",
    ownerPingRole: "1336721165892194414",
    ticketCategoryId: "1396669148569931856",
    ticketChannelId: "1396669269281996830", // ← ← ← ← ← ← أضف هذا السطر يا نجم
    welcomeMessage: "أهلاً بك! الرجاء مراجعة شروط الشراكة واختيار المستوى المناسب.",
    levels: {
basic: {
  title: "🟢 المستوى الأساسي",
  minMembers: 60,
  minOnline: 30,
  requirements: [
    "عدد الأعضاء: من 60 إلى 100",
    "تفاعل دائم",
    "خالي من السب تمامًا",
    "عدد الأونلاين: من 30 إلى 50"
  ]
},
medium: {
  title: "🟡 المستوى المتوسط",
  minMembers: 100,
  minOnline: 50,
  requirements: [
    "عدد الأعضاء: من 100 إلى 150",
    "خالي من السب تمامًا",
    "متفاعل دائمًا",
    "عدد الأونلاين: من 50 إلى 70"
  ]
},
advanced: {
  title: "🔴 المستوى الكبير",
  minMembers: 500,
  minOnline: 200,
  requirements: [
    "عدد الأعضاء: من 500 إلى 1000",
    "خالي من السب تمامًا",
    "متفاعل دائمًا",
    "عدد الأونلاين: من 200 إلى 300"
  ]
}
    }
  }
};
